#Область ЗаготовкаБСП

// Возвращает сведения о внешней обработке.
//Функция СведенияОВнешнейОбработке() Экспорт
//	
//	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.4.5.71");
//	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
//		
//	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
//	ПараметрыРегистрации.Версия = "2024.05.08";
//		
//	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
//	НоваяКоманда.Представление = НСтр("ru = 'Отправка сообщения сервисов интеграции'");
//	НоваяКоманда.Идентификатор = "ОтправкаСообщенияСервисовИнтеграции";
//	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
//	НоваяКоманда.ПоказыватьОповещение = Ложь;  
//	
//	Возврат ПараметрыРегистрации;
//	
//КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция для возврата минимальной версии при которой будет работать история данных
Функция МинимальнаяВерсияПлатформы()
	Возврат "8.3.17";	
КонецФункции

// Функция для возврата версии в которой появилось свойство РазмерТела
Функция ВерсияСРазмерТела()
	Возврат "8.3.21";	
КонецФункции


// Определяет используемую версию платформы.
//
//	Параметры:
//		ВерсияПлатформы - Строка - Пример: "8.3.11.2867"
//
// Возвращаемое значение:
//	Структура:
//   Отработал - Булево - Истина, функция возвращает нормальный результат, 
//   					Ложь означает, что результат получить не удалось.
//	 ТекстОшибки - Строка - Описание ошибки
//   Результат - Строка - Текущая версия конфигуратора или режима совместимости
//
Функция ТекущаяВерсияПлатформы(ВидПроверки = "МинимальнаяВерсияПлатформы") Экспорт 
	
	Результат = Новый Структура("Отработал, ТекстОшибки, Результат", Истина, "", 0);
	
	АктуальнаяСистемнаяИнформация = Новый СистемнаяИнформация;
		
	// 8.3.11.2867
	перВерсияПриложения = АктуальнаяСистемнаяИнформация.ВерсияПриложения;  
	 
	Если ВидПроверки = "МинимальнаяВерсияПлатформы" Тогда  
		МинимальнаяВерсия = МинимальнаяВерсияПлатформы();     
	Иначе
		МинимальнаяВерсия = ВерсияСРазмерТела();	
	КонецЕсли;	  
	
	// Основная проверка
	Если ВерсияСтаршеИлиРавнаВерсии(перВерсияПриложения, МинимальнаяВерсия) Тогда
		
		Результат.Результат = перВерсияПриложения;	   
		
	Иначе
		
		Результат.Отработал = Ложь;
		текТекстОшибки = НСтр("ru = 'Версия платформы ( %1 ), необходима версия не ниже ( %2 )'");
		Результат.ТекстОшибки	=  СтрШаблон(текТекстОшибки, перВерсияПриложения, МинимальнаяВерсия); 
		
	КонецЕсли;	
					
    Возврат Результат;
	
КонецФункции


// Сравниваем две версии и возвращаем Истина если ПроверяемаяВерсия >= ЭталоннаяВерсия,
// в противном случае возвращаем Ложь
Функция ВерсияСтаршеИлиРавнаВерсии(ПроверяемаяВерсия, ЭталоннаяВерсия)
	
	СтруктураПроверяемаяВерсия 	= ВернутьСтруктуруПоВерсии(ПроверяемаяВерсия);	
	СтруктураЭталоннаяВерсия 	= ВернутьСтруктуруПоВерсии(ЭталоннаяВерсия);
	
	Результат = Истина;
	
	Если Число(СтруктураПроверяемаяВерсия.НомерВерсии) > Число(СтруктураЭталоннаяВерсия.НомерВерсии) Тогда 
		
		Возврат Результат;
		
	ИначеЕсли Число(СтруктураПроверяемаяВерсия.НомерВерсии) < Число(СтруктураЭталоннаяВерсия.НомерВерсии) Тогда 
		
		Результат = Ложь;
		
	Иначе // СтруктураПроверяемаяВерсия.НомерВерсии = СтруктураЭталоннаяВерсия
		
		Если Число(СтруктураПроверяемаяВерсия.НомерРедакции) > Число(СтруктураЭталоннаяВерсия.НомерРедакции) Тогда
			
			Возврат Результат;
		
		ИначеЕсли Число(СтруктураПроверяемаяВерсия.НомерРедакции) < Число(СтруктураЭталоннаяВерсия.НомерРедакции) Тогда
			
			Результат = Ложь;
			
		Иначе // СтруктураПроверяемаяВерсия.НомерРедакции = СтруктураЭталоннаяВерсия.НомерРедакции
			
			Если Число(СтруктураПроверяемаяВерсия.НомерРелиза) > Число(СтруктураЭталоннаяВерсия.НомерРелиза) Тогда
				
				Возврат Результат;	
			
			ИначеЕсли Число(СтруктураПроверяемаяВерсия.НомерРелиза) < Число(СтруктураЭталоннаяВерсия.НомерРелиза) Тогда 
				
				Результат = Ложь;
				
			Иначе  // СтруктураПроверяемаяВерсия.НомерРелиза = СтруктураЭталоннаяВерсия.НомерРелиза
				
				Если СтруктураПроверяемаяВерсия.НомерПодрелиза <> "0" Тогда 
					
					Если Число(СтруктураПроверяемаяВерсия.НомерПодрелиза) > Число(СтруктураЭталоннаяВерсия.НомерПодрелиза) Тогда
				
						Возврат Результат;	
					
					ИначеЕсли Число(СтруктураПроверяемаяВерсия.НомерПодрелиза) < Число(СтруктураЭталоннаяВерсия.НомерПодрелиза) Тогда 
						
						Результат = Ложь;
						
					Иначе 
						
						Возврат Результат;
						
				    КонецЕсли; // НомерПодрелиза
				КонецЕсли; // НомерПодрелиза <> "0"
			КонецЕсли; // НомерРелиза	
        КонецЕсли; // НомерРедакции
	КонецЕсли; // НомерВерсии	
	
	Возврат Результат;
	
КонецФункции 

// Возвращает структуру по версии 
//	Параметры:
//		ВерсияПлатформы - Строка - Пример: "8.3.11.2867" 
//
// 	Возвращаемое значение:
// 	Структура:
//		НомерВерсии 	- Строка - Пример: "8"
//		НомерРедакции 	- Строка - Пример: "3"
//		НомерРелиза		- Строка - Пример: "11"
//		НомерПодрелиза 	- Строка - Пример: "2867"
Функция ВернутьСтруктуруПоВерсии(ВерсияПлатформы)
	
	массивРазделенныхЭлементов = СтрРазделить(ВерсияПлатформы, ".", Истина);    
	
	Если массивРазделенныхЭлементов.Количество() < 4 Тогда 
		Пока массивРазделенныхЭлементов.Количество() < 4 Цикл 
			массивРазделенныхЭлементов.Добавить("0");
		КонецЦикла;	
	КонецЕсли;
	
	СтруктураВерсияПриложения = Новый Структура("НомерВерсии, НомерРедакции, НомерРелиза, НомерПодрелиза"
						,массивРазделенныхЭлементов[0]
						,массивРазделенныхЭлементов[1]
						,массивРазделенныхЭлементов[2]
						,массивРазделенныхЭлементов[3]);

	Возврат СтруктураВерсияПриложения;
	
КонецФункции

#КонецОбласти

