#Область ЗаготовкаБСП

// Возвращает сведения о внешней обработке.
//Функция СведенияОВнешнейОбработке() Экспорт
//	
//	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.4.5.71");
//	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
//		
//	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
//	ПараметрыРегистрации.Версия = "2024.05.06";
//		
//	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
//	НоваяКоманда.Представление = НСтр("ru = 'Сообщения сервисов интеграции'");
//	НоваяКоманда.Идентификатор = "СообщенияСервисовИнтеграции";
//	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
//	НоваяКоманда.ПоказыватьОповещение = Ложь;  
//	
//	Возврат ПараметрыРегистрации;
//	
//КонецФункции

#КонецОбласти